package homework4Cycle;

import java.util.Scanner;

/**
 * Написать игру в которой нужно угадать случайно выбранную букву (именно букву).
 * При каждом вводе пользователем программа должна говорить "warmly, hot" или "chilly, cold"
 * в зависимости от того, как далеко буква пользователя от загаданной.
 */

/**
 char c = '0';
 System.out.println(c);
 System.out.println((int)c);

 */
public class Game {
    public static void main(String[] args) {
       // Scanner in = new Scanner(System.in);
       // System.out.println("Enter a letter from A to Z ");
        //String letter=in.nextLine();
        //char[] chArray = String.toCharArray();
        //char char = String.charAt(1);

       // int lNum = letter;

        char c = 'A';
        char v = 'B';
        int i = c;
        int j = v;

       // if
      // System.out.println("ASCII value of '" + letter + "' is: " + lNum);

        System.out.println("ASCII value of '" + c + "' is: " + i);
        System.out.println("ASCII value of '" + v + "' is: " + j);



    }
}
